---
kind: method
id: M:Autodesk.Revit.DB.IUpdater.GetUpdaterId
source: html/d00e60eb-6123-3ce3-c158-4a2b4ff0b387.htm
---
# Autodesk.Revit.DB.IUpdater.GetUpdaterId Method

Returns globally unique updater id - used to identify the Updater
 Called once during registration of the updater

## Syntax (C#)
```csharp
UpdaterId GetUpdaterId()
```